[
    {
        "Name": "Avocado Toast",
        "Ingredients": "Avocado: 1/2, Bread: 1 slice, Lemon juice: 1 tsp, Salt: Pinch, Pepper: Pinch",
        "Instructions": "1) Slice the avocado in half and remove the pit. Scoop out the avocado flesh and mash it with a fork. 2) Toast the bread until it is crispy. 3) Spread the mashed avocado on top of the toast. 4) Squeeze the lemon juice over the avocado and sprinkle with salt and pepper. 5) Enjoy immediately.",
        "NutritionalInformation": "Serving size: 1 toast (67g), Calories: 153, Fat: 11g, Sodium: 211mg, Carbohydrates: 14g, Fiber: 5g, Sugar: 1g, Protein: 4g",
        "Dietary": "Vegan, Vegetarian"
    },
    {
        "name": "Grilled Vegetable Skewers",
        "ingredients": "Zucchini: 1, Yellow squash: 1, Red bell pepper: 1, Yellow bell pepper: 1, Red onion: 1/2, Olive oil: 1 tsp, Salt: Pinch, Pepper: Pinch",
        "instructions": "1) Preheat the grill to medium-high heat. 2) Cut the zucchini, squash, bell peppers, and onion into 1-inch pieces. Thread the vegetables onto skewers, alternating between the different types. 3) Brush the skewers with olive oil and sprinkle with salt and pepper. 4) Grill the skewers for 8)10 minutes, turning occasionally, until the vegetables are tender and lightly charred. 5) Serve the skewers hot off the grill.",
        "nutritionalInformation": "servingSize: 1 skewer (70g), calories: 41, fat: 2g, sodium: 6mg, carbohydrates: 6g, fiber: 2g, sugar: 4g, protein: 1g",
        "dietary": "Vegan, Vegetarian, Gluten Free, Dairy Free, Cutting"
    },
    {
        "name": "Shrimp and Asparagus Stir-Fry",
        "ingredients": "Shrimp: 1/2 lb, Asparagus: 1/2 lb, Garlic: 2 cloves, Ginger: 1 tsp, Soy sauce: 2 tbsp, Rice vinegar: 1 tbsp, Sesame oil: 1 tsp, Red pepper flakes: 1/4 tsp",
        "instructions": "1) Heat a wok or large frying pan over high heat. 2) Add the shrimp and cook for 2-3 minutes, or until pink and opaque. Remove the shrimp from the pan and set aside. 3) Add the asparagus to the pan and stir-fry for 3-4 minutes, or until tender. 4) In a small bowl, whisk together the garlic, ginger, soy sauce, rice vinegar, sesame oil, and red pepper flakes. 5) Add the sauce to the pan with the asparagus and stir to coat. 6) Add the cooked shrimp back into the pan and stir to combine. 7) Serve the stir-fry hot over rice or noodles.",
        "nutritionalInformation": "Serving Size: 1 cup (217g), Calories: 147, Fat: 3g, Sodium: 744mg, Carbohydrates: 14g, Fiber: 3g, Sugar: 5g, Protein: 20g",
        "dietary": "Dairy-free, cutting"
    },
    {
        "name": "Quinoa and Black Bean Salad",
        "ingredients": "Quinoa: 1 cup, Black beans: 1 cup, Tomato: 1, Red onion: 1/4, Cilantro: 1/4 cup, Lime juice: 2 tbsp, Extra virgin olive oil: 1 tbsp, Ground cumin: 1/2 tsp, Salt: Pinch",
        "instructions": "1) Cook the quinoa according to package instructions. 2) Drain and rinse the black beans. 3) Chop the tomato and red onion into small pieces. Chop the cilantro. 4) In a large bowl, combine the cooked quinoa, black beans, tomato, red onion, and cilantro. 5) In a small bowl, whisk together the lime juice, olive oil, cumin, and salt. 6) Pour the dressing over the quinoa mixture and stir to coat. 7) Serve the salad cold or at room temperature.",
        "nutritionalInformation": "serving size: 1 cup (246g), calories: 277, fat: 10g, sodium: 292mg, carbohydrates: 39g, fiber: 9g, sugar: 3g, protein: 10g",
        "dietary": "Vegan, Vegetarian, Gluten Free, Dairy Free, Cutting"
    },
    {
        "name": "Turkey Lettuce Wraps",
        "ingredients": "Ground turkey (1/2 lb), Red bell pepper (1), Carrots (1 cup), Green onions (1/4 cup), Hoisin sauce (2 tbsp), Lettuce leaves (8), Peanuts (1/4 cup)",
        "instructions": "1) In a large frying pan, cook the ground turkey over medium-high heat until it is browned and fully cooked. 2) While the turkey is cooking, chop the bell pepper, carrots, and green onions. 3) Once the turkey is cooked, add the bell pepper, carrots, and green onions to the pan. Stir in the hoisin sauce. 4) Cook for an additional 2-3 minutes, or until the vegetables are tender. 5) Divide the turkey mixture among the lettuce leaves. 6) Top each wrap with a sprinkle of peanuts. 7) Serve the wraps immediately.",
        "nutritionalInformation": "Serving size: 1 wrap (107g), Calories: 182, Fat: 8g, Sodium: 300mg, Carbohydrates: 11g, Fiber: 2g, Sugar: 5g, Protein: 20g",
        "dietary": "Dairy-free, Cutting"
    },
    {
        "name": "Spaghetti Squash with Tomato Sauce",
        "ingredients": "Spaghetti Squash: 1, Tomato Sauce: 1 cup, Ground turkey: 1/2 lb, Basil: 1/4 cup, Grated Parmesan Cheese: 1/4 cup",
        "instructions": "1) Preheat the oven to 400°F (200°C). 2) Cut the spaghetti squash in half lengthwise and scoop out the seeds. 3) Place the squash halves cut-side down on a baking sheet. Bake for 30-40 minutes, or until the squash is tender. 4) While the squash is cooking, cook the ground turkey in a large frying pan over medium-high heat until it is browned and fully cooked. 5) Stir in the tomato sauce and simmer for 5 minutes. 6) Once the squash is cooked, use a fork to scrape the strands of squash into a large bowl. 7) Add the sauce and ground turkey to the bowl with the spaghetti squash and toss to combine. 8) Top with fresh basil and grated parmesan cheese. 9) Serve the spaghetti squash hot.",
        "nutritionalInformation": "Serving Size: 1 cup (246g), Calories: 279, Fat: 10g, Sodium: 494mg, Carbohydrates: 30g, Fiber: 6g, Sugar: 11g, Protein: 24g",
        "dietary": "Gluten-Free, Cutting"
    },
    {
        "name": "Shrimp and Vegetable Stir-Fry",
        "ingredients": "Shrimp: 1 lb, Broccoli florets: 2 cups, Red bell pepper: 1, Carrots: 1 cup, Snow peas: 1 cup, Soy sauce: 3 tbsp, Rice vinegar: 1 tbsp, Sesame oil: 1 tsp, Garlic: 2 cloves, Ginger: 1 tsp, Cornstarch: 2 tsp, Water: 2 tbsp",
        "instructions": "1) Rinse the shrimp and pat them dry with paper towels. Chop the broccoli, bell pepper, carrots, and snow peas into bite-sized pieces. 2) In a small bowl, whisk together the soy sauce, rice vinegar, sesame oil, garlic, ginger, cornstarch, and water. 3) Heat a large frying pan or wok over high heat. Add the vegetables to the pan and stir-fry for 2-3 minutes, or until they are tender. 4) Add the shrimp to the pan and stir-fry for an additional 2-3 minutes, or until the shrimp are pink and fully cooked. 5) Stir in the sauce and cook for an additional 1-2 minutes, or until the sauce has thickened. 6) Serve the stir-fry hot over rice or noodles.",
        "nutritionalInformation": "Serving Size: 1 cup (246g), Calories: 216, Fat: 4g, Sodium: 858mg, Carbohydrates: 19g, Fiber: 4g, Sugar: 6g, Protein: 27g",
        "dietary": "Gluten-Free, Dairy-Free, Cutting"
    },
    {
        "name": "Cauliflower Fried Rice",
        "ingredients": "Cauliflower: 1 medium head, Eggs: 2, Peas: 1 cup, Carrots: 1 cup, Green onions: 1/2 cup, Soy sauce: 2 tbsp, Sesame oil: 1 tsp, Garlic: 2 cloves, Ginger: 1 tsp",
        "instructions": "1) Cut the cauliflower into small florets and pulse them in a food processor until they are the size of grains of rice. 2) Beat the eggs in a small bowl. 3) Heat a large frying pan or wok over medium heat. Add the eggs to the pan and scramble them until they are fully cooked. 4) Remove the eggs from the pan and set them aside. 5) In the same pan, add the cauliflower, peas, carrots, green onions, soy sauce, sesame oil, garlic, and ginger. Stir-fry for 5-6)minutes, or until the vegetables are tender. 6) Stir in the cooked eggs and cook for an additional 1-2 minutes, or until everything is heated through. 7) Serve the cauliflower fried rice hot.",
        "nutritionalInformation": "Serving Size: 1 cup (246g), Calories: 124, Fat: 5g, Sodium: 534mg, Carbohydrates: 13g, Fiber: 4g, Sugar: 6g, Protein: 10g",
        "dietary": "gluten-free, dairy-free, cutting"
    },

    {
        "name": "Vegetable and Tofu Stir-fry",
        "ingredients": "Tofu: 1 block (14 oz), mixed vegetables (such as bell peppers, carrots, broccoli, bok choy, or mushrooms): 4 cups, garlic: 2 cloves, ginger: 1 tsp, soy sauce: 2 tbsp, rice vinegar: 2 tbsp, sesame oil: 1 tsp, corn starch: 1 tsp, water: 1/4 cup",
        "instructions": "1) Drain and press the tofu to remove excess moisture. Cut it into 1-inch cubes. 2) In a small bowl, mix together the garlic, ginger, soy sauce, rice vinegar, sesame oil, corn starch, and water to make the sauce. 3) Heat a large skillet or wok over high heat. 4) Add the tofu to the skillet and stir-fry for 2-3 minutes or until lightly golden brown. 5) Remove the tofu from the skillet and set it aside. 6) In the same skillet, add the mixed vegetables and stir-fry for 2-3 minutes or until tender. 7) Add the sauce to the skillet and stir to combine. 8) Add the tofu back to the skillet and stir to coat with the sauce. 9) Cook for an additional 1-2 minutes or until everything is heated through. 10) Serve the Vegetable and Tofu stir-fry over rice or noodles",
        "nutritionalInformation": "Serving Size: 1 cup (246g), Calories: 250, Fat: 14g, Sodium: 1034mg, Carbohydrates: 14g, Fiber: 4g, Sugar: 6g, Protein: 15g",
        "dietary": "Gluten-free, Dairy-free, Vegetarian"
    },
    {
        "name": "Salmon Poke Bowl",
        "ingredients": "Salmon fillet: 8 oz, brown rice: 1 cup, avocado: 1 medium, cucumber: 1 medium, carrots: 1 medium, radishes: 4, green onions: 2, sesame seeds: 1 tbsp, soy sauce: 2 tbsp, rice vinegar: 2 tbsp, sesame oil: 1 tsp, wasabi: 1 tsp",
        "instructions": "1) Cut the salmon into small cubes and set aside. 2) Cook the brown rice according to package instructions and set aside. 3) In a small bowl, mix together the soy sauce, rice vinegar, sesame oil, and wasabi to make the marinade. 4) Pour the marinade over the salmon cubes and toss to coat. 5) Cut the avocado, cucumber, carrots, radishes, and green onions into small cubes. 6) Divide the cooked rice among 4 bowls. 7) Top the rice with the marinated salmon, avocado, cucumber, carrots, radishes, and green onions. 8) Sprinkle sesame seeds over the top",
        "nutritionalInformation": "Serving Size: 1 bowl, Calories: 474, Fat: 24g, Sodium: 874mg, Carbohydrates: 38g, Fiber: 6g, Sugar: 4g, Protein: 29g",
        "dietary": "Gluten-free, Dairy-free, Bulking, low-fat, low-carb"
    },
    {
        "name": "Turkish-style Eggplant and Ground Lamb Casserole",
        "ingredients": "Eggplant: 2 medium, ground lamb: 1 lb, onion: 1 large, diced, tomatoes: 1 can diced, garlic: 3 cloves, minced, paprika: 1 tsp, cumin: 1 tsp, oregano: 1 tsp, salt: 1/4 tsp, pepper: 1/4 tsp, yogurt: 1/2 cup, fresh parsley: 1/4 cup, chopped",
        "instructions": "1) Preheat the oven to 350°F. 2) Peel and slice the eggplant into 1/4-inch rounds. 3) Heat a large skillet over medium-high heat, add some oil and cook the eggplant for about 3-4 minutes or until golden brown. Remove the eggplant from the skillet and set it aside. 4) In the same skillet, add the ground lamb and cook until browned, then add the diced onions and garlic, and cook until softened. 5) Add the diced tomatoes, paprika, cumin, oregano, salt, and pepper and stir. 6) Layer half of the eggplant in the bottom of a baking dish, then add the ground lamb mixture on top of it. 7) Repeat the layers and top it with yogurt. 8) Cover the dish with foil and bake for 30 minutes. 9) Remove the foil and bake for an additional 15 minutes. 10) Let it cool for a few minutes and garnish with chopped parsley before serving",
        "nutritionalInformation": "Serving Size: 1 cup (246g), Calories: 250, Fat: 14g, Sodium: 534mg, Carbohydrates: 13g, Fiber: 4g, Sugar: 6g, Protein: 20g",
        "dietary": "Gluten-free, Dairy-free, High protein, low-fat"
    },
    {
        "name": "African-style Peanut Stew",
        "ingredients": "Sweet potatoes: 2 medium, diced, red bell pepper: 1, diced, onion: 1, diced, garlic: 2 cloves, minced, tomato: 1, diced, vegetable broth: 4 cups, smooth peanut butter: 1/2 cup, diced tomatoes: 1 can, chickpeas: 1 can, drained and rinsed, cayenne pepper: 1/4 tsp, ground cumin: 1 tsp, ground coriander: 1 tsp, salt: 1/4 tsp, pepper: 1/4 tsp, chopped peanuts: 2 tbsp, chopped cilantro: 2 tbsp",
        "instructions": "1) Heat a large pot over medium heat and add some oil. 2) Add the onion, garlic and sweet potatoes and cook for about 5 minutes or until softened. 3) Add the diced red bell pepper, tomato and spices and stir. 4) Pour in the vegetable broth and diced tomatoes and bring to a simmer. 5) Stir in the peanut butter, chickpeas and bring the stew to a simmer again. 6) Reduce the heat and let the stew simmer for about 20 minutes or until the vegetables are tender. 7) Season with salt and pepper to taste. 8) Serve the stew over rice or quinoa and garnish with chopped peanuts and cilantro",
        "nutritionalInformation": "Serving Size: 1 cup (246g), Calories: 350, Fat: 20g, Sodium: 534mg, Carbohydrates: 28g, Fiber: 6g, Sugar: 12g, Protein: 12g",
        "dietary": "Gluten-free, Vegan, High fiber, low-fat"
    },


    {
        "name": "Spicy Szechuan Green Beans",
        "ingredients": "Green beans: 1 lb, vegetable oil: 2 tbsp, garlic: 2 cloves, minced, ginger: 1 tsp, minced, red pepper flakes: 1 tsp, Szechuan peppercorns: 1 tsp, soy sauce: 1 tbsp, rice vinegar: 1 tbsp, sugar: 1 tsp, corn starch: 1 tsp, water: 2 tbsp",
        "instructions": "1) Trim the ends of the green beans and cut them into 2-inch pieces. 2) Heat a large skillet or wok over high heat and add the vegetable oil. 3) Add the garlic, ginger, red pepper flakes, and Szechuan peppercorns and stir-fry for 30 seconds. 4) Add the green beans and stir-fry for 3-4 minutes or until they are tender-crisp. 5) In a small bowl, mix together the soy sauce, rice vinegar, sugar, corn starch, and water to make the sauce. 6) Add the sauce to the skillet and stir to coat the green beans. 7) Cook for an additional 1-2 minutes or until the sauce thickens. 8) Serve the Spicy Szechuan Green Beans as a side dish or over rice",
        "nutritionalInformation": "Serving Size: 1 cup (246g), Calories: 100, Fat: 7g, Sodium: 534mg, Carbohydrates: 7g, Fiber: 2g, Sugar: 3g, Protein: 2g",
        "dietary": "Gluten-free, Dairy-free, Vegan, Low-carb, Low-fat"
    },
    {
        "name": "Japanese-style Chicken and Vegetable Curry",
        "ingredients": "Boneless, skinless chicken breast: 2 (6 oz), chopped, onion: 1, diced, carrots: 2, diced, potatoes: 2, diced, garlic: 2 cloves, minced, ginger: 1 tsp, minced, curry powder: 2 tsp, flour: 2 tbsp, chicken broth: 2 cups, coconut milk: 1 cup, salt: 1/4 tsp, pepper: 1/4 tsp",
        "instructions": "1) Heat a large pot over medium heat and add some oil. 2) Add the onions, garlic, ginger and cook until softened. 3) Add the chicken, curry powder, flour and stir until the chicken is browned. 4) Add the chicken broth, coconut milk, potatoes, carrots, salt and pepper and bring to a simmer. 5) Cover the pot and let it simmer for about 25 minutes or until the vegetables are tender. 6) Adjust the seasoning if needed and serve over rice",
        "nutritionalInformation": "Serving Size: 1 cup (246g), Calories: 350, Fat: 20g, Sodium: 534mg, Carbohydrates: 28g, Fiber: 6g, Sugar: 12g, Protein: 20g",
        "dietary": "Gluten-free, High protein, High-carb"
    },
    {
        "name": "Tuna and Cucumber Salad",
        "ingredients": "Tuna: 1 can drained, Cucumber: 1 medium, sliced, red onion: 1/4 cup, thinly sliced, Rice vinegar: 2 tbsp, Soy sauce: 1 tsp, Sesame oil: 1 tsp, Sugar: 1 tsp, Salt: 1/4 tsp, Pepper: 1/4 tsp, Sesame seeds: 1 tbsp, chopped green onions: 1 tbsp",
        "instructions": "1) Drain the tuna and flake it into small pieces. 2) Cut the cucumber in half lengthwise, then thinly slice them. 3) In a small bowl, mix together the rice vinegar, soy sauce, sesame oil, sugar, salt, and pepper to make the dressing. 4) In a large bowl, add the tuna, cucumber, and red onion. 5) Pour the dressing over the tuna mixture and toss to coat. 6) Sprinkle the sesame seeds and green onions over the top",
        "nutritionalInformation": "Serving Size: 1 cup (246g), Calories: 120, Fat: 5g, Sodium: 534mg, Carbohydrates: 6g, Fiber: 1g, Sugar: 3g, Protein: 15g",
        "dietary": "Gluten-free, Dairy-free, Low-carb, Low-fat, High protein"
    },
    {
        "name": "Swedish Meatballs with Lingonberry Sauce",
        "ingredients": "Ground beef: 1 lb, ground pork: 1/2 lb, breadcrumbs: 1/4 cup, onion: 1/2 cup, grated, garlic: 2 cloves, minced, egg: 1, salt: 1 tsp, pepper: 1/4 tsp, allspice: 1/4 tsp, butter: 2 tbsp, beef broth: 1 cup, heavy cream: 1/2 cup, lingonberry preserves: 1/4 cup, xanthan gum: 1 tsp",
        "instructions": "1) In a large mixing bowl, combine the ground beef, ground pork, breadcrumbs, onion, garlic, egg, salt, pepper, and allspice. Mix everything together until well combined. 2) Form the mixture into small meatballs. 3) In a large skillet, melt the butter over medium heat. 4) Add the meatballs and cook until browned on all sides. 5) Remove the meatballs from the skillet and set them aside. 6) In the same skillet, add the beef broth and bring it to a simmer. 7) Stir in the heavy cream and lingonberry preserves. 8) Let the sauce simmer for about 5 minutes. 9) Remove the skillet from the heat and stir in the xanthan gum. 10) Return the meatballs to the skillet and toss to coat them in the sauce",
        "nutritionalInformation": "Serving Size: 1 cup (246g), Calories: 350, Fat: 20g, Sodium: 534mg, Carbohydrates: 10g, Fiber: 1g, Sugar: 3g, Protein: 30g",
        "dietary": "Low-sugar, Gluten-free"
    },
    {
        "name": "Vietnamese Beef and Vegetable Stir-fry",
        "ingredients": "Beef sirloin: 1 lb, sliced, vegetables of your choice: 3 cups, sliced (such as bell peppers, onions, carrots, mushrooms), garlic: 4 cloves, minced, ginger: 2 tsp, minced, oyster sauce: 2 tbsp, soy sauce: 1 tbsp, sugar: 1 tsp, corn starch: 1 tsp, water: 2 tbsp, cooked rice: 4 cups",
        "instructions": "1) Heat a large skillet or wok over high heat and add some oil. 2) Add the beef and stir-fry for 3-4 minutes or until browned. 3) Remove the beef from the skillet and set it aside. 4) Add the vegetables, garlic, ginger to the skillet and stir-fry for 3-4 minutes or until they are tender-crisp. 5) In a small bowl, mix together the oyster sauce, soy sauce, sugar, corn starch, and water to make the sauce. 6) Add the sauce to the skillet and stir to coat the vegetables. 7) Add the beef back to the skillet and stir-fry for an additional 1-2 minutes or until everything is heated through. 8) Serve the stir-fry over cooked rice",
        "nutritionalInformation": "Serving Size: 1 cup (246g), Calories: 400, Fat: 20g, Sodium: 534mg, Carbohydrates: 30g, Fiber: 3g, Sugar: 6g, Protein: 32g",
        "dietary": "Gluten-free, High protein, High-carb, Low-fat"
    },
    {
        "name": "Vietnamese Shrimp and Herb Salad",
        "ingredients": "Shrimp: 1 lb, peeled and deveined, mixed greens: 4 cups, mint: 1/2 cup, chopped, cilantro: 1/2 cup, chopped, basil: 1/4 cup, chopped, red onion: 1/4 cup, thinly sliced, lime: 2, juiced, fish sauce: 2 tbsp, sugar: 1 tsp, chili flakes: 1 tsp, salt and pepper to taste",
        "instructions": "1) Cook the shrimp in a skillet over medium heat until pink and cooked through. 2) Remove the shrimp from the skillet and set it aside to cool. 3) In a large bowl, combine mixed greens, mint, cilantro, basil, red onion, and cooled shrimp. 4) In a small bowl, mix together the lime juice, fish sauce, sugar, chili flakes, salt, and pepper to make the dressing. 5) Pour the dressing over the salad and toss to combine. 6) Serve the salad chilled",
        "nutritionalInformation": "Serving Size: 1 cup (246g), Calories: 150, Fat: 2g, Sodium: 534mg, Carbohydrates: 10g, Fiber: 3g, Sugar: 3g, Protein: 20g",
        "dietary": "Gluten-free, Low-carb, Low-fat, High protein"
     }

        
]